#+TITLE: Category Theory for Programmers
#+OPTIONS: d:nil

** Challenges
:RENO_MARKER_IDS:
okular-{0d975a16-5a37-4340-9320-a16f8cbe7be5}
:END:

#+BEGIN_QUOTE
Implement, as best as you can, the identity function in your favorite language
#+END_QUOTE
:RENO_MARKER_IDS:
okular-{1a4350d1-e061-4398-b440-d6c5e42437e8}
:END:

#+BEGIN_SRC scala :exports code
def id[A](a: A): A = a
#+END_SRC

#+RESULTS:
: defined function id

#+BEGIN_QUOTE
Implement the composition function in your favorite language.
It takes two functions as arguments and returns a function that is their composition.
#+END_QUOTE
:RENO_MARKER_IDS:
okular-{657f331a-2db9-4f63-a35f-c11fddb1f009}
:END:

#+BEGIN_SRC scala :exports code
def compose[A, B, C](f: A => B)(g: B => C): A => C = a => g(f(a))
#+END_SRC

#+RESULTS:
: defined function compose

#+BEGIN_QUOTE
Write a program that tries to test that your composition function respects identity.
#+END_QUOTE
:RENO_MARKER_IDS:
okular-{a05f94c9-7cdf-486c-95b0-6dd60ab39d31}
:END:

#+BEGIN_SRC scala :exports both
compose[Int, Int, Int](id)(id)(4) == 4
#+END_SRC

#+RESULTS:
: res2: Boolean = true



#+BEGIN_QUOTE
Is the world-wide web a category in any sense? Are links morphisms?
#+END_QUOTE
:RENO_MARKER_IDS:
okular-{709f2f6c-50ab-46fe-b09d-1bbcfde1889b}
:END:

Yes


#+BEGIN_QUOTE
Is Facebook a category, with people as objects and friendships as morphisms?
#+END_QUOTE
:RENO_MARKER_IDS:
okular-{b7f62d8a-8e8f-477c-bdc0-1f55ae3cd512}
:END:

Yes - the morphism is 'relationship'.


#+BEGIN_QUOTE
When is a directed graph a category?
#+END_QUOTE
:RENO_MARKER_IDS:
okular-{b585e808-9b94-4d69-8d8a-7c6731ecfcce}
:END:

If there is an identity arrow on each node.

